---
kind: other
id: Methods.T:Autodesk.Revit.DB.Electrical.DistributionSysType
source: html/0a1ffdc7-f7f4-7b84-cef1-f5ecf3b5779b.htm
---
# DistributionSysType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.